app/views/comments/_index.html.erb

<ul>
  <% if @post.comments.size < 2 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 2