app/controllers/comments_controller.rb

  def load_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]

  def show
    @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @comment = @post.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["created_at", Thu, 15 Dec 2011 14:25:59 UTC +00:00], ["post_id", 2], ["updated_at", Thu, 15 Dec 2011 14:25:59 UTC +00:00]]

  def update
    @comment = @post.comments.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "body" = '甘すぎず苦すぎない絶妙なバランス', "updated_at" = '2011-12-15 14:35:33.015625' WHERE "comments"."id" = 1