app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "TEST"], ["created_at", Thu, 15 Dec 2011 14:05:52 UTC +00:00], ["title", "TEST"], ["updated_at", Thu, 15 Dec 2011 14:05:52 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = '缶コーヒー', "body" = 'ジョージアの
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])